grevaillot/svd_tools/headers/ATSAMV71Q21/piod.h
/** @defgroup piod_pio_ower PIOOWER Output Write Enable
@{*/

/** PIOD_PIO_OWER_P31 Output Write Enable **/
#define PIOD_PIO_OWER_P31		(1 << 31)
/** PIOD_PIO_OWER_P30 Output Write Enable **/
#define PIOD_PIO_OWER_P30		(1 << 30)
/** PIOD_PIO_OWER_P29 Output Write Enable **/
#define PIOD_PIO_OWER_P29		(1 << 29)
/** PIOD_PIO_OWER_P28 Output Write Enable **/
#define PIOD_PIO_OWER_P28		(1 << 28)
/** PIOD_PIO_OWER_P27 Output Write Enable **/
#define PIOD_PIO_OWER_P27		(1 << 27)
/** PIOD_PIO_OWER_P26 Output Write Enable **/
#define PIOD_PIO_OWER_P26		(1 << 26)
/** PIOD_PIO_OWER_P25 Output Write Enable **/
#define PIOD_PIO_OWER_P25		(1 << 25)
/** PIOD_PIO_OWER_P24 Output Write Enable **/
#define PIOD_PIO_OWER_P24		(1 << 24)
/** PIOD_PIO_OWER_P23 Output Write Enable **/
#define PIOD_PIO_OWER_P23		(1 << 23)
/** PIOD_PIO_OWER_P22 Output Write Enable **/
#define PIOD_PIO_OWER_P22		(1 << 22)
/** PIOD_PIO_OWER_P21 Output Write Enable **/
#define PIOD_PIO_OWER_P21		(1 << 21)
/** PIOD_PIO_OWER_P20 Output Write Enable **/
#define PIOD_PIO_OWER_P20		(1 << 20)
/** PIOD_PIO_OWER_P19 Output Write Enable **/
#define PIOD_PIO_OWER_P19		(1 << 19)
/** PIOD_PIO_OWER_P18 Output Write Enable **/
#define PIOD_PIO_OWER_P18		(1 << 18)
/** PIOD_PIO_OWER_P17 Output Write Enable **/
#define PIOD_PIO_OWER_P17		(1 << 17)
/** PIOD_PIO_OWER_P16 Output Write Enable **/
#define PIOD_PIO_OWER_P16		(1 << 16)
/** PIOD_PIO_OWER_P15 Output Write Enable **/
#define PIOD_PIO_OWER_P15		(1 << 15)
/** PIOD_PIO_OWER_P14 Output Write Enable **/
#define PIOD_PIO_OWER_P14		(1 << 14)
/** PIOD_PIO_OWER_P13 Output Write Enable **/
#define PIOD_PIO_OWER_P13		(1 << 13)
/** PIOD_PIO_OWER_P12 Output Write Enable **/
#define PIOD_PIO_OWER_P12		(1 << 12)
/** PIOD_PIO_OWER_P11 Output Write Enable **/
#define PIOD_PIO_OWER_P11		(1 << 11)
/** PIOD_PIO_OWER_P10 Output Write Enable **/
#define PIOD_PIO_OWER_P10		(1 << 10)
/** PIOD_PIO_OWER_P9 Output Write Enable **/
#define PIOD_PIO_OWER_P9		(1 << 9)
/** PIOD_PIO_OWER_P8 Output Write Enable **/
#define PIOD_PIO_OWER_P8		(1 << 8)
/** PIOD_PIO_OWER_P7 Output Write Enable **/
#define PIOD_PIO_OWER_P7		(1 << 7)
/** PIOD_PIO_OWER_P6 Output Write Enable **/
#define PIOD_PIO_OWER_P6		(1 << 6)
/** PIOD_PIO_OWER_P5 Output Write Enable **/
#define PIOD_PIO_OWER_P5		(1 << 5)
/** PIOD_PIO_OWER_P4 Output Write Enable **/
#define PIOD_PIO_OWER_P4		(1 << 4)
/** PIOD_PIO_OWER_P3 Output Write Enable **/
#define PIOD_PIO_OWER_P3		(1 << 3)
/** PIOD_PIO_OWER_P2 Output Write Enable **/
#define PIOD_PIO_OWER_P2		(1 << 2)
/** PIOD_PIO_OWER_P1 Output Write Enable **/
#define PIOD_PIO_OWER_P1		(1 << 1)
/** PIOD_PIO_OWER_P0 Output Write Enable **/
#define PIOD_PIO_OWER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_owdr PIOOWDR Output Write Disable
@{*/

/** PIOD_PIO_OWDR_P31 Output Write Disable **/
#define PIOD_PIO_OWDR_P31		(1 << 31)
/** PIOD_PIO_OWDR_P30 Output Write Disable **/
#define PIOD_PIO_OWDR_P30		(1 << 30)
/** PIOD_PIO_OWDR_P29 Output Write Disable **/
#define PIOD_PIO_OWDR_P29		(1 << 29)
/** PIOD_PIO_OWDR_P28 Output Write Disable **/
#define PIOD_PIO_OWDR_P28		(1 << 28)
/** PIOD_PIO_OWDR_P27 Output Write Disable **/
#define PIOD_PIO_OWDR_P27		(1 << 27)
/** PIOD_PIO_OWDR_P26 Output Write Disable **/
#define PIOD_PIO_OWDR_P26		(1 << 26)
/** PIOD_PIO_OWDR_P25 Output Write Disable **/
#define PIOD_PIO_OWDR_P25		(1 << 25)
/** PIOD_PIO_OWDR_P24 Output Write Disable **/
#define PIOD_PIO_OWDR_P24		(1 << 24)
/** PIOD_PIO_OWDR_P23 Output Write Disable **/
#define PIOD_PIO_OWDR_P23		(1 << 23)
/** PIOD_PIO_OWDR_P22 Output Write Disable **/
#define PIOD_PIO_OWDR_P22		(1 << 22)
/** PIOD_PIO_OWDR_P21 Output Write Disable **/
#define PIOD_PIO_OWDR_P21		(1 << 21)
/** PIOD_PIO_OWDR_P20 Output Write Disable **/
#define PIOD_PIO_OWDR_P20		(1 << 20)
/** PIOD_PIO_OWDR_P19 Output Write Disable **/
#define PIOD_PIO_OWDR_P19		(1 << 19)
/** PIOD_PIO_OWDR_P18 Output Write Disable **/
#define PIOD_PIO_OWDR_P18		(1 << 18)
/** PIOD_PIO_OWDR_P17 Output Write Disable **/
#define PIOD_PIO_OWDR_P17		(1 << 17)
/** PIOD_PIO_OWDR_P16 Output Write Disable **/
#define PIOD_PIO_OWDR_P16		(1 << 16)
/** PIOD_PIO_OWDR_P15 Output Write Disable **/
#define PIOD_PIO_OWDR_P15		(1 << 15)
/** PIOD_PIO_OWDR_P14 Output Write Disable **/
#define PIOD_PIO_OWDR_P14		(1 << 14)
/** PIOD_PIO_OWDR_P13 Output Write Disable **/
#define PIOD_PIO_OWDR_P13		(1 << 13)
/** PIOD_PIO_OWDR_P12 Output Write Disable **/
#define PIOD_PIO_OWDR_P12		(1 << 12)
/** PIOD_PIO_OWDR_P11 Output Write Disable **/
#define PIOD_PIO_OWDR_P11		(1 << 11)
/** PIOD_PIO_OWDR_P10 Output Write Disable **/
#define PIOD_PIO_OWDR_P10		(1 << 10)
/** PIOD_PIO_OWDR_P9 Output Write Disable **/
#define PIOD_PIO_OWDR_P9		(1 << 9)
/** PIOD_PIO_OWDR_P8 Output Write Disable **/
#define PIOD_PIO_OWDR_P8		(1 << 8)
/** PIOD_PIO_OWDR_P7 Output Write Disable **/
#define PIOD_PIO_OWDR_P7		(1 << 7)
/** PIOD_PIO_OWDR_P6 Output Write Disable **/
#define PIOD_PIO_OWDR_P6		(1 << 6)
/** PIOD_PIO_OWDR_P5 Output Write Disable **/
#define PIOD_PIO_OWDR_P5		(1 << 5)
/** PIOD_PIO_OWDR_P4 Output Write Disable **/
#define PIOD_PIO_OWDR_P4		(1 << 4)
/** PIOD_PIO_OWDR_P3 Output Write Disable **/
#define PIOD_PIO_OWDR_P3		(1 << 3)
/** PIOD_PIO_OWDR_P2 Output Write Disable **/
#define PIOD_PIO_OWDR_P2		(1 << 2)
/** PIOD_PIO_OWDR_P1 Output Write Disable **/
#define PIOD_PIO_OWDR_P1		(1 << 1)
/** PIOD_PIO_OWDR_P0 Output Write Disable **/
#define PIOD_PIO_OWDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_owsr PIOOWSR Output Write Status Register
@{*/

/** PIOD_PIO_OWSR_P31 Output Write Status **/
#define PIOD_PIO_OWSR_P31		(1 << 31)
/** PIOD_PIO_OWSR_P30 Output Write Status **/
#define PIOD_PIO_OWSR_P30		(1 << 30)
/** PIOD_PIO_OWSR_P29 Output Write Status **/
#define PIOD_PIO_OWSR_P29		(1 << 29)
/** PIOD_PIO_OWSR_P28 Output Write Status **/
#define PIOD_PIO_OWSR_P28		(1 << 28)
/** PIOD_PIO_OWSR_P27 Output Write Status **/
#define PIOD_PIO_OWSR_P27		(1 << 27)
/** PIOD_PIO_OWSR_P26 Output Write Status **/
#define PIOD_PIO_OWSR_P26		(1 << 26)
/** PIOD_PIO_OWSR_P25 Output Write Status **/
#define PIOD_PIO_OWSR_P25		(1 << 25)
/** PIOD_PIO_OWSR_P24 Output Write Status **/
#define PIOD_PIO_OWSR_P24		(1 << 24)
/** PIOD_PIO_OWSR_P23 Output Write Status **/
#define PIOD_PIO_OWSR_P23		(1 << 23)
/** PIOD_PIO_OWSR_P22 Output Write Status **/
#define PIOD_PIO_OWSR_P22		(1 << 22)
/** PIOD_PIO_OWSR_P21 Output Write Status **/
#define PIOD_PIO_OWSR_P21		(1 << 21)
/** PIOD_PIO_OWSR_P20 Output Write Status **/
#define PIOD_PIO_OWSR_P20		(1 << 20)
/** PIOD_PIO_OWSR_P19 Output Write Status **/
#define PIOD_PIO_OWSR_P19		(1 << 19)
/** PIOD_PIO_OWSR_P18 Output Write Status **/
#define PIOD_PIO_OWSR_P18		(1 << 18)
/** PIOD_PIO_OWSR_P17 Output Write Status **/
#define PIOD_PIO_OWSR_P17		(1 << 17)
/** PIOD_PIO_OWSR_P16 Output Write Status **/
#define PIOD_PIO_OWSR_P16		(1 << 16)
/** PIOD_PIO_OWSR_P15 Output Write Status **/
#define PIOD_PIO_OWSR_P15		(1 << 15)
/** PIOD_PIO_OWSR_P14 Output Write Status **/
#define PIOD_PIO_OWSR_P14		(1 << 14)
/** PIOD_PIO_OWSR_P13 Output Write Status **/
#define PIOD_PIO_OWSR_P13		(1 << 13)
/** PIOD_PIO_OWSR_P12 Output Write Status **/
#define PIOD_PIO_OWSR_P12		(1 << 12)
/** PIOD_PIO_OWSR_P11 Output Write Status **/
#define PIOD_PIO_OWSR_P11		(1 << 11)
/** PIOD_PIO_OWSR_P10 Output Write Status **/
#define PIOD_PIO_OWSR_P10		(1 << 10)
/** PIOD_PIO_OWSR_P9 Output Write Status **/
#define PIOD_PIO_OWSR_P9		(1 << 9)
/** PIOD_PIO_OWSR_P8 Output Write Status **/
#define PIOD_PIO_OWSR_P8		(1 << 8)
/** PIOD_PIO_OWSR_P7 Output Write Status **/
#define PIOD_PIO_OWSR_P7		(1 << 7)
/** PIOD_PIO_OWSR_P6 Output Write Status **/
#define PIOD_PIO_OWSR_P6		(1 << 6)
/** PIOD_PIO_OWSR_P5 Output Write Status **/
#define PIOD_PIO_OWSR_P5		(1 << 5)
/** PIOD_PIO_OWSR_P4 Output Write Status **/
#define PIOD_PIO_OWSR_P4		(1 << 4)
/** PIOD_PIO_OWSR_P3 Output Write Status **/
#define PIOD_PIO_OWSR_P3		(1 << 3)
/** PIOD_PIO_OWSR_P2 Output Write Status **/
#define PIOD_PIO_OWSR_P2		(1 << 2)
/** PIOD_PIO_OWSR_P1 Output Write Status **/
#define PIOD_PIO_OWSR_P1		(1 << 1)
/** PIOD_PIO_OWSR_P0 Output Write Status **/
#define PIOD_PIO_OWSR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_aimer PIOAIMER Additional Interrupt Modes Enable Register
@{*/

/** PIOD_PIO_AIMER_P31 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P31		(1 << 31)
/** PIOD_PIO_AIMER_P30 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P30		(1 << 30)
/** PIOD_PIO_AIMER_P29 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P29		(1 << 29)
/** PIOD_PIO_AIMER_P28 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P28		(1 << 28)
/** PIOD_PIO_AIMER_P27 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P27		(1 << 27)
/** PIOD_PIO_AIMER_P26 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P26		(1 << 26)
/** PIOD_PIO_AIMER_P25 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P25		(1 << 25)
/** PIOD_PIO_AIMER_P24 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P24		(1 << 24)
/** PIOD_PIO_AIMER_P23 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P23		(1 << 23)
/** PIOD_PIO_AIMER_P22 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P22		(1 << 22)
/** PIOD_PIO_AIMER_P21 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P21		(1 << 21)
/** PIOD_PIO_AIMER_P20 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P20		(1 << 20)
/** PIOD_PIO_AIMER_P19 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P19		(1 << 19)
/** PIOD_PIO_AIMER_P18 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P18		(1 << 18)
/** PIOD_PIO_AIMER_P17 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P17		(1 << 17)
/** PIOD_PIO_AIMER_P16 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P16		(1 << 16)
/** PIOD_PIO_AIMER_P15 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P15		(1 << 15)
/** PIOD_PIO_AIMER_P14 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P14		(1 << 14)
/** PIOD_PIO_AIMER_P13 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P13		(1 << 13)
/** PIOD_PIO_AIMER_P12 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P12		(1 << 12)
/** PIOD_PIO_AIMER_P11 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P11		(1 << 11)
/** PIOD_PIO_AIMER_P10 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P10		(1 << 10)
/** PIOD_PIO_AIMER_P9 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P9		(1 << 9)
/** PIOD_PIO_AIMER_P8 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P8		(1 << 8)
/** PIOD_PIO_AIMER_P7 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P7		(1 << 7)
/** PIOD_PIO_AIMER_P6 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P6		(1 << 6)
/** PIOD_PIO_AIMER_P5 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P5		(1 << 5)
/** PIOD_PIO_AIMER_P4 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P4		(1 << 4)
/** PIOD_PIO_AIMER_P3 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P3		(1 << 3)
/** PIOD_PIO_AIMER_P2 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P2		(1 << 2)
/** PIOD_PIO_AIMER_P1 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P1		(1 << 1)
/** PIOD_PIO_AIMER_P0 Additional Interrupt Modes Enable **/
#define PIOD_PIO_AIMER_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_aimdr PIOAIMDR Additional Interrupt Modes Disable Register
@{*/

/** PIOD_PIO_AIMDR_P31 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P31		(1 << 31)
/** PIOD_PIO_AIMDR_P30 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P30		(1 << 30)
/** PIOD_PIO_AIMDR_P29 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P29		(1 << 29)
/** PIOD_PIO_AIMDR_P28 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P28		(1 << 28)
/** PIOD_PIO_AIMDR_P27 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P27		(1 << 27)
/** PIOD_PIO_AIMDR_P26 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P26		(1 << 26)
/** PIOD_PIO_AIMDR_P25 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P25		(1 << 25)
/** PIOD_PIO_AIMDR_P24 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P24		(1 << 24)
/** PIOD_PIO_AIMDR_P23 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P23		(1 << 23)
/** PIOD_PIO_AIMDR_P22 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P22		(1 << 22)
/** PIOD_PIO_AIMDR_P21 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P21		(1 << 21)
/** PIOD_PIO_AIMDR_P20 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P20		(1 << 20)
/** PIOD_PIO_AIMDR_P19 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P19		(1 << 19)
/** PIOD_PIO_AIMDR_P18 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P18		(1 << 18)
/** PIOD_PIO_AIMDR_P17 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P17		(1 << 17)
/** PIOD_PIO_AIMDR_P16 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P16		(1 << 16)
/** PIOD_PIO_AIMDR_P15 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P15		(1 << 15)
/** PIOD_PIO_AIMDR_P14 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P14		(1 << 14)
/** PIOD_PIO_AIMDR_P13 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P13		(1 << 13)
/** PIOD_PIO_AIMDR_P12 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P12		(1 << 12)
/** PIOD_PIO_AIMDR_P11 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P11		(1 << 11)
/** PIOD_PIO_AIMDR_P10 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P10		(1 << 10)
/** PIOD_PIO_AIMDR_P9 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P9		(1 << 9)
/** PIOD_PIO_AIMDR_P8 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P8		(1 << 8)
/** PIOD_PIO_AIMDR_P7 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P7		(1 << 7)
/** PIOD_PIO_AIMDR_P6 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P6		(1 << 6)
/** PIOD_PIO_AIMDR_P5 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P5		(1 << 5)
/** PIOD_PIO_AIMDR_P4 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P4		(1 << 4)
/** PIOD_PIO_AIMDR_P3 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P3		(1 << 3)
/** PIOD_PIO_AIMDR_P2 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P2		(1 << 2)
/** PIOD_PIO_AIMDR_P1 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P1		(1 << 1)
/** PIOD_PIO_AIMDR_P0 Additional Interrupt Modes Disable **/
#define PIOD_PIO_AIMDR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_aimmr PIOAIMMR Additional Interrupt Modes Mask Register
@{*/

/** PIOD_PIO_AIMMR_P31 IO Line Index **/
#define PIOD_PIO_AIMMR_P31		(1 << 31)
/** PIOD_PIO_AIMMR_P30 IO Line Index **/
#define PIOD_PIO_AIMMR_P30		(1 << 30)
/** PIOD_PIO_AIMMR_P29 IO Line Index **/
#define PIOD_PIO_AIMMR_P29		(1 << 29)
/** PIOD_PIO_AIMMR_P28 IO Line Index **/
#define PIOD_PIO_AIMMR_P28		(1 << 28)
/** PIOD_PIO_AIMMR_P27 IO Line Index **/
#define PIOD_PIO_AIMMR_P27		(1 << 27)
/** PIOD_PIO_AIMMR_P26 IO Line Index **/
#define PIOD_PIO_AIMMR_P26		(1 << 26)
/** PIOD_PIO_AIMMR_P25 IO Line Index **/
#define PIOD_PIO_AIMMR_P25		(1 << 25)
/** PIOD_PIO_AIMMR_P24 IO Line Index **/
#define PIOD_PIO_AIMMR_P24		(1 << 24)
/** PIOD_PIO_AIMMR_P23 IO Line Index **/
#define PIOD_PIO_AIMMR_P23		(1 << 23)
/** PIOD_PIO_AIMMR_P22 IO Line Index **/
#define PIOD_PIO_AIMMR_P22		(1 << 22)
/** PIOD_PIO_AIMMR_P21 IO Line Index **/
#define PIOD_PIO_AIMMR_P21		(1 << 21)
/** PIOD_PIO_AIMMR_P20 IO Line Index **/
#define PIOD_PIO_AIMMR_P20		(1 << 20)
/** PIOD_PIO_AIMMR_P19 IO Line Index **/
#define PIOD_PIO_AIMMR_P19		(1 << 19)
/** PIOD_PIO_AIMMR_P18 IO Line Index **/
#define PIOD_PIO_AIMMR_P18		(1 << 18)
/** PIOD_PIO_AIMMR_P17 IO Line Index **/
#define PIOD_PIO_AIMMR_P17		(1 << 17)
/** PIOD_PIO_AIMMR_P16 IO Line Index **/
#define PIOD_PIO_AIMMR_P16		(1 << 16)
/** PIOD_PIO_AIMMR_P15 IO Line Index **/
#define PIOD_PIO_AIMMR_P15		(1 << 15)
/** PIOD_PIO_AIMMR_P14 IO Line Index **/
#define PIOD_PIO_AIMMR_P14		(1 << 14)
/** PIOD_PIO_AIMMR_P13 IO Line Index **/
#define PIOD_PIO_AIMMR_P13		(1 << 13)
/** PIOD_PIO_AIMMR_P12 IO Line Index **/
#define PIOD_PIO_AIMMR_P12		(1 << 12)
/** PIOD_PIO_AIMMR_P11 IO Line Index **/
#define PIOD_PIO_AIMMR_P11		(1 << 11)
/** PIOD_PIO_AIMMR_P10 IO Line Index **/
#define PIOD_PIO_AIMMR_P10		(1 << 10)
/** PIOD_PIO_AIMMR_P9 IO Line Index **/
#define PIOD_PIO_AIMMR_P9		(1 << 9)
/** PIOD_PIO_AIMMR_P8 IO Line Index **/
#define PIOD_PIO_AIMMR_P8		(1 << 8)
/** PIOD_PIO_AIMMR_P7 IO Line Index **/
#define PIOD_PIO_AIMMR_P7		(1 << 7)
/** PIOD_PIO_AIMMR_P6 IO Line Index **/
#define PIOD_PIO_AIMMR_P6		(1 << 6)
/** PIOD_PIO_AIMMR_P5 IO Line Index **/
#define PIOD_PIO_AIMMR_P5		(1 << 5)
/** PIOD_PIO_AIMMR_P4 IO Line Index **/
#define PIOD_PIO_AIMMR_P4		(1 << 4)
/** PIOD_PIO_AIMMR_P3 IO Line Index **/
#define PIOD_PIO_AIMMR_P3		(1 << 3)
/** PIOD_PIO_AIMMR_P2 IO Line Index **/
#define PIOD_PIO_AIMMR_P2		(1 << 2)
/** PIOD_PIO_AIMMR_P1 IO Line Index **/
#define PIOD_PIO_AIMMR_P1		(1 << 1)
/** PIOD_PIO_AIMMR_P0 IO Line Index **/
#define PIOD_PIO_AIMMR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_esr PIOESR Edge Select Register
@{*/

/** PIOD_PIO_ESR_P31 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P31		(1 << 31)
/** PIOD_PIO_ESR_P30 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P30		(1 << 30)
/** PIOD_PIO_ESR_P29 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P29		(1 << 29)
/** PIOD_PIO_ESR_P28 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P28		(1 << 28)
/** PIOD_PIO_ESR_P27 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P27		(1 << 27)
/** PIOD_PIO_ESR_P26 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P26		(1 << 26)
/** PIOD_PIO_ESR_P25 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P25		(1 << 25)
/** PIOD_PIO_ESR_P24 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P24		(1 << 24)
/** PIOD_PIO_ESR_P23 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P23		(1 << 23)
/** PIOD_PIO_ESR_P22 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P22		(1 << 22)
/** PIOD_PIO_ESR_P21 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P21		(1 << 21)
/** PIOD_PIO_ESR_P20 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P20		(1 << 20)
/** PIOD_PIO_ESR_P19 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P19		(1 << 19)
/** PIOD_PIO_ESR_P18 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P18		(1 << 18)
/** PIOD_PIO_ESR_P17 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P17		(1 << 17)
/** PIOD_PIO_ESR_P16 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P16		(1 << 16)
/** PIOD_PIO_ESR_P15 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P15		(1 << 15)
/** PIOD_PIO_ESR_P14 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P14		(1 << 14)
/** PIOD_PIO_ESR_P13 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P13		(1 << 13)
/** PIOD_PIO_ESR_P12 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P12		(1 << 12)
/** PIOD_PIO_ESR_P11 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P11		(1 << 11)
/** PIOD_PIO_ESR_P10 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P10		(1 << 10)
/** PIOD_PIO_ESR_P9 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P9		(1 << 9)
/** PIOD_PIO_ESR_P8 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P8		(1 << 8)
/** PIOD_PIO_ESR_P7 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P7		(1 << 7)
/** PIOD_PIO_ESR_P6 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P6		(1 << 6)
/** PIOD_PIO_ESR_P5 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P5		(1 << 5)
/** PIOD_PIO_ESR_P4 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P4		(1 << 4)
/** PIOD_PIO_ESR_P3 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P3		(1 << 3)
/** PIOD_PIO_ESR_P2 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P2		(1 << 2)
/** PIOD_PIO_ESR_P1 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P1		(1 << 1)
/** PIOD_PIO_ESR_P0 Edge Interrupt Selection **/
#define PIOD_PIO_ESR_P0		(1 << 0)

/**@}*/

/** @defgroup piod_pio_lsr PIOLSR Level Select Register
@{*/

/** PIOD_PIO_LSR_P31 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P31		(1 << 31)
/** PIOD_PIO_LSR_P30 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P30		(1 << 30)
/** PIOD_PIO_LSR_P29 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P29		(1 << 29)
/** PIOD_PIO_LSR_P28 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P28		(1 << 28)
/** PIOD_PIO_LSR_P27 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P27		(1 << 27)
/** PIOD_PIO_LSR_P26 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P26		(1 << 26)
/** PIOD_PIO_LSR_P25 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P25		(1 << 25)
/** PIOD_PIO_LSR_P24 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P24		(1 << 24)
/** PIOD_PIO_LSR_P23 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P23		(1 << 23)
/** PIOD_PIO_LSR_P22 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P22		(1 << 22)
/** PIOD_PIO_LSR_P21 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P21		(1 << 21)
/** PIOD_PIO_LSR_P20 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P20		(1 << 20)
/** PIOD_PIO_LSR_P19 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P19		(1 << 19)
/** PIOD_PIO_LSR_P18 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P18		(1 << 18)
/** PIOD_PIO_LSR_P17 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P17		(1 << 17)
/** PIOD_PIO_LSR_P16 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P16		(1 << 16)
/** PIOD_PIO_LSR_P15 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P15		(1 << 15)
/** PIOD_PIO_LSR_P14 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P14		(1 << 14)
/** PIOD_PIO_LSR_P13 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P13		(1 << 13)
/** PIOD_PIO_LSR_P12 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P12		(1 << 12)
/** PIOD_PIO_LSR_P11 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P11		(1 << 11)
/** PIOD_PIO_LSR_P10 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P10		(1 << 10)
/** PIOD_PIO_LSR_P9 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P9		(1 << 9)
/** PIOD_PIO_LSR_P8 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P8		(1 << 8)
/** PIOD_PIO_LSR_P7 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P7		(1 << 7)
/** PIOD_PIO_LSR_P6 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P6		(1 << 6)
/** PIOD_PIO_LSR_P5 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P5		(1 << 5)
/** PIOD_PIO_LSR_P4 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P4		(1 << 4)
/** PIOD_PIO_LSR_P3 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P3		(1 << 3)
/** PIOD_PIO_LSR_P2 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P2		(1 << 2)
/** PIOD_PIO_LSR_P1 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P1		(1 << 1)
/** PIOD_PIO_LSR_P0 Level Interrupt Selection **/
#define PIOD_PIO_LSR_P0		(1 << 0)

/**@}*/

